In [1]:
import pandas as pd

In [41]:
df = pd.read_clipboard()

In [12]:
df

   Student_Id  Marks_10  Marks_12  Marks_Grad  State  Salary
0           1      45.0       NaN        56.0    1.0      10
1           2       NaN      65.0        67.0    1.0      12
2           3      54.0      68.0        57.0    0.0      14
3           4      89.0      88.0         NaN    NaN      18
4           5       NaN      87.0        84.0    1.0      21

In [21]:
from sklearn.impute import KNNImputer
imputer = KNNImputer(n_neighbors=1)
df.iloc[:] = imputer.fit_transform(df.iloc[:])

C:\Users\rahul\AppData\Local\Temp\ipykernel_6360\1443806324.py:3: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.iloc[:] = imputer.fit_transform(df.iloc[:])

In [22]:
df

   Student_Id  Marks_10  Marks_12  Marks_Grad  State  Salary
0         1.0      45.0      68.0        56.0    1.0    10.0
1         2.0      54.0      65.0        67.0    1.0    12.0
2         3.0      54.0      68.0        57.0    0.0    14.0
3         4.0      89.0      88.0        84.0    1.0    18.0
4         5.0      89.0      87.0        84.0    1.0    21.0

In [42]:
x = df.iloc[:].values

In [30]:
import numpy as np 
from sklearn.impute import SimpleImputer
impute = SimpleImputer(missing_values=np.nan, strategy='mean')
imputer = impute.fit(x[:,1:2])
x[:,1:2] = imputer.transform(x[:,1:2])

In [32]:
pd.DataFrame(x)

     0          1     2     3    4     5
0  1.0  45.000000   NaN  56.0  1.0  10.0
1  2.0  62.666667  65.0  67.0  1.0  12.0
2  3.0  54.000000  68.0  57.0  0.0  14.0
3  4.0  89.000000  88.0   NaN  NaN  18.0
4  5.0  62.666667  87.0  84.0  1.0  21.0

In [34]:
df

   Student_Id  Marks_10  Marks_12  Marks_Grad  State  Salary
0           1      45.0       NaN        56.0    1.0      10
1           2       NaN      65.0        67.0    1.0      12
2           3      54.0      68.0        57.0    0.0      14
3           4      89.0      88.0         NaN    NaN      18
4           5       NaN      87.0        84.0    1.0      21

In [43]:
import numpy as np 
from sklearn.impute import SimpleImputer
impute = SimpleImputer(missing_values=np.nan, strategy='mean')
x[:,1:2] = impute.fit_transform(x[:,1:2])

In [44]:
pd.DataFrame(x)

     0          1     2     3    4     5
0  1.0  45.000000   NaN  56.0  1.0  10.0
1  2.0  62.666667  65.0  67.0  1.0  12.0
2  3.0  54.000000  68.0  57.0  0.0  14.0
3  4.0  89.000000  88.0   NaN  NaN  18.0
4  5.0  62.666667  87.0  84.0  1.0  21.0

In [45]:
import numpy as np 
from sklearn.impute import SimpleImputer
impute = SimpleImputer(missing_values=np.nan, strategy='most_frequent')
x[:,4:5] = impute.fit_transform(x[:,4:5])

In [46]:
x

array([[ 1.        , 45.        ,         nan, 56.        ,  1.        ,
        10.        ],
       [ 2.        , 62.66666667, 65.        , 67.        ,  1.        ,
        12.        ],
       [ 3.        , 54.        , 68.        , 57.        ,  0.        ,
        14.        ],
       [ 4.        , 89.        , 88.        ,         nan,  1.        ,
        18.        ],
       [ 5.        , 62.66666667, 87.        , 84.        ,  1.        ,
        21.        ]])

In [47]:
df = pd.read_clipboard()

In [48]:
df

  Department  Age  Experience
0         HR   21           1
1         HR   33          12
2         IT   35          12
3         IT   36          12
4         HR   34          11
5         IT   33          13
6  Marketing   34          12
7         HR   32          10
8  Marketing   31           2
9         IT   55          35

In [53]:
q1 = df.quantile(0.25)

C:\Users\rahul\AppData\Local\Temp\ipykernel_6360\3169776471.py:1: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  q1 = df.quantile(0.25)

In [54]:
q3 =df.quantile(0.75)

C:\Users\rahul\AppData\Local\Temp\ipykernel_6360\1125482695.py:1: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  q3 =df.quantile(0.75)

In [55]:
iqr = df.quantile(0.75) - df.quantile(0.25)

C:\Users\rahul\AppData\Local\Temp\ipykernel_6360\2564830063.py:1: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  iqr = df.quantile(0.75) - df.quantile(0.25)

In [56]:
q1

Age           32.25
Experience    10.25
Name: 0.25, dtype: float64

In [58]:
q3

Age           34.75
Experience    12.00
Name: 0.75, dtype: float64

In [59]:
iqr

Age           2.50
Experience    1.75
dtype: float64

In [62]:
df[~((df<(q1-1.5*iqr)) | (df>(q3+1.5*iqr))).any(axis=1)]

C:\Users\rahul\AppData\Local\Temp\ipykernel_6360\1113956730.py:1: FutureWarning: Automatic reindexing on DataFrame vs Series comparisons is deprecated and will raise ValueError in a future version. Do `left, right = left.align(right, axis=1, copy=False)` before e.g. `left == right`
  df[~((df<(q1-1.5*iqr)) | (df>(q3+1.5*iqr))).any(axis=1)]

  Department  Age  Experience
1         HR   33          12
2         IT   35          12
3         IT   36          12
4         HR   34          11
5         IT   33          13
6  Marketing   34          12
7         HR   32          10

In [63]:
def outlier_treatment(dataframe):
    Q1 = dataframe.quantile(0.25)
    Q3 = dataframe.quantile(0.75)
    IQR = Q3-Q1
    df_rem_out = dataframe[~((dataframe<(Q1-1.5*IQR)) | (dataframe>(Q3+1.5*IQR))).any(axis=1)]
    return df_rem_out

In [65]:
outlier_treatment(df)

C:\Users\rahul\AppData\Local\Temp\ipykernel_6360\1111629882.py:2: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  Q1 = dataframe.quantile(0.25)
C:\Users\rahul\AppData\Local\Temp\ipykernel_6360\1111629882.py:3: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  Q3 = dataframe.quantile(0.75)
C:\Users\rahul\AppData\Local\Temp\ipykernel_6360\1111629882.py:5: FutureWarning: Automatic reindexing on DataFrame vs Series comparisons is deprecated and will raise ValueError in a future version. Do `left, right = left.align(right, axis=1, copy=False)` before e.g. `left == right`
  df_rem_out = dataframe[~((dataframe<(Q1-1.5*IQR)) | (dataframe>(Q3+1.5*IQR))).any(axis=1)]

  Department  Age  Experience
1         HR   33          12
2         IT   35          12
3         IT   36          12
4         HR   34          11
5         IT   33          13
6  Marketing   34          12
7         HR   32          10